---
kind: enumMember
id: F:Autodesk.Revit.DB.DividedPathMeasurementType.SegmentLength
enum: Autodesk.Revit.DB.DividedPathMeasurementType
source: html/1f13d14f-6a42-6718-9a86-c792874680d0.htm
---
# Autodesk.Revit.DB.DividedPathMeasurementType.SegmentLength

Distances between two points are measured along the path segment between the points.